# StonePatternMap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stone..::..StonePatternMap Property
Stone Class See Also
---
The property labeled "Image" from the "Stone" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string StonePatternMap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StonePatternMap As String
	Get
```

Visual C++
---
```text
public:
static property String^ StonePatternMap {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
# See Also
Stone Class
Autodesk.Revit.DB.Visual Namespace